Repository: giellalt/corpus-nob
Catalog: prestable/tmx/goldstandard/sme/facta/skuvlahistorja4/kirsten-n.htm.tmx
Source language: nob
Languages: sme

source: Vi bodde der en stund og det ble ordnet med klær og utstyr til meg .
sme: Oruimet doppe moadde beaivvi ja sii lágidedje munnje biktasiid ja eará maid dárbbašin .

source: Der fikk jeg ny risku [ 1 ] og to liidni [ 2 ] og to kofter .
sme: Doppe ožžon riskku , guokte liinni ja guokte gávtti .

source: Jeg skjønte ikke hvorfor jeg fikk to kofter , liidni og ull-liidni .
sme: In ipmirdan manne ožžon guokte gávtti , liinni ja ulloliinni .

source: Det ble også ordnet med skaller og bellinger .
sme: Adde munnje goikkehiid ja bittuid vel .

source: Jeg syntes det var stas .
sme: Mu mielas lei dat olles ávvu .

source: Etter å ha vært der noen dager gikk det opp for meg jeg at jeg skulle reise .
sme: Go ledjen orron doppe moadde beaivvi , de ipmirdin ahte mun galgen vuolgit .

source: Da gråt jeg stille .
sme: De čirron jaskadit .

source: På gamlehjemmet jobbet en døv kvinne som het Bolette , senere gift Westavik .
sme: Boarrásiidruovttus lei bealjehis nissonolmmoš man namma lei Bolette , maŋŋil náitalan Westavikan .

source: Hun vasket og stelte for de eldre der .
sme: Son basai ja divššui boarrásiid doppe .

source: Bolette bodde bare et par år i Kautokeino og senere flyttet hun til Trondheim .
sme: Bolette orui dušše moadde jagi Guovdageainnus , de son fárrii Troandimii .

source: Hun hadde gått på døveskolen og hadde bilder fra da hun ble konfirmert der .
sme: Son lei vázzán bealjehemiid skuvlla ja sus ledje govat dan áiggis go konfirmerejuvvui doppe .

source: Jeg så at hun brukte tegn .
sme: Oidnen ahte son máhtii čájehansániid .

source: Hun fortalte at hun var døv slik som meg og hadde gått på døveskolen .
sme: Son muitalii son lei bealjeheapmi nu go mun ja lei vázzán bealjehemiid skuvlla .

source: Jeg forsto hva en fremmed sa .
sme: Ipmirdin maid son amas olmmoš muitalii .

source: Det var en forunderlig opplevelse .
sme: Lei oba erenoamáš vásáhus munnje .

source: Jeg forsto at jeg skulle reise til den skolen på bildene for å lære meg å lese og skrive sammen med mange andre barn .
sme: Ipmirdin ahte galgen vuolgit dan skuvlii mii oidnui govain ja galgen oahppat lohkat ja čállit ollu eará mánáiguin ovttas .

source: Men for å erte meg fortalte hun at hvis jeg ikke var lydig kom lærerne til å klype meg i øreflippene .
sme: Son hárddašii mu ja muitalii ahte jos in lean siivui , de gal oahpaheaddji cikcii mu bealljái .

source: Jeg visste ikke om det var sant og undret meg mye , for jeg hadde ikke øreflipper .
sme: In diehtán leaččai go duohta ja imaštallen sakka , eai hal mus lean goit bealljelasttat .

source: Hun var den eneste jeg hadde møtt i mitt liv som sa at hun var lik meg .
sme: Son lei áidna olmmoš mu eallimis gii lei dadjan ahte son lei maiddái dakkár go mun .

source: Jeg var kanskje den første fra Kautokeino som ble sendt til døveskole .
sme: Soiten vuosttaš Guovdageain-olmmoš gii sáddejuvvojin bealjehemiid skuvlii .

source: Senere ble Anders Buljo også sendt til døveskolen .
sme: Maŋŋil sáddejuvvui Anders Buljo maiddái bealjehemiid skuvlii .

source: Han var på det tidspunktet 15 år .
sme: Son lei dalle 15-jahkásaš .

source: Jeg synes det er merkelig .
sme: Mu mielas dat lea imaš .

source: Men han ble senere sendt til Andebu [ 3 ] for han « pratet » visst ikke .
sme: Maŋŋil sáddejedje su Andebuai [ 1 ] vissa danne go son ii « hupman » .

source: Det synes jeg var urettferdig og mener det var en feilplassering .
sme: Mu mielas ii lean dat vuoiggalaš , oaivvildan dat lei boasttu báiki sutnje .

source: Senere ble han blind , kom hjem og ble værende hos sin familie .
sme: Son čalmmehuvai maŋŋil , máhcai fas ruoktot ja orrugođii iežas olbmuid hálddus .

source: Han var dyktig å jobbe , men snakket ikke .
sme: Son lei čeahpes bargi , muhto ii son hupman .

source: Hva som gjorde at det ble slik , det vet jeg ikke .
sme: In dieđe manne leaččai šaddan dakkárin .

source: Heldigvis kom jeg til Tromsø til undersøkelse og senere til døveskolen tidligere enn han , takket være min mor .
sme: Lihkus mun bessen Romsii iskkademiide ja dasto bealjehemiid skuvlii ovdal go son , eadnán dat rábidii mu dohko .

source: Lang reise til Trondheim
sme: Guhkes mátki Troandimii

source: Så ble det slik at Anders Pentha ordnet med hesteskyss til Alta .
sme: Ja de šattai nu ahte Anders Pentha doalvvui mu heastasáhtuin Áltái .

source: Det var jo ikke bilskyss den gangen .
sme: Ii dalle lean biilasáhttu .

source: Han hadde bondegård med hest og var bare 20 år tror jeg .
sme: Sus lei oapmedállu ja heasta ja doaivvun son lei dušše 20 jahkásaš .

source: Astrid Solberg , som var sykepleier fra Stavanger , skulle reise til Tromsø og fulgte meg på veien .
sme: Astrid Solberg , gii lei buohccedikšu ja Stavangeris eret , lei vuolgime Romssa gávpogii ja ofelasttii mu .

source: Det var en lang reise .
sme: Lei guhkes mátki .

source: Vi overnattet i Alta og der fikk jeg se krigen .
sme: Idjadeimme Álttás ja doppe oidnen soađi .

source: Jeg visste ikke det var krig og hadde heller ingen begreper om hva det var .
sme: In diehtán soahti dat lei , ii ge mus lean dasa mihkkege ipmárdusaid .

source: Jeg bare så soldater komme .
sme: Oidnen soalddáhiid boahtime .

source: Sykepleieren og jeg var ute og gikk og plutselig så tutet det bak oss .
sme: Moai buohccedikšuin leimme vázzime go fáhkkestaga báládii munno maŋábealde .

source: Det var nok et skikkelig rabalder , men jeg hørte ingenting .
sme: Lei vissa hirbmat rigearra , muhto mun in gullan das maidege .

source: Hun røsket meg til siden .
sme: Son gaikkihii mu doaresbeallái .

source: Jeg kunne ha blitt drept !
sme: Livččen sáhttán vuojahallat jámas !

source: Soldatene så veldig sinte ut og jeg ble veldig redd .
sme: Soalddáhat orro suhttan hirbmadit ja mun suorganin .

source: De kom i lastebiler på lastebiler og slikt hadde jeg ikke sett før .
sme: Lástabiillat bohte maŋŋemaŋŋálaga , in lean oaidnán dakkáriid ovdal .

source: Etter to dager dro vi med båt sørover .
sme: Golle guokte beaivvi , ja de vulggiime lulás fatnasa mielde .

source: På turen videre fikk vi følge av en mann som hadde jobbet i Finnmark i mange år og skulle reise hjem .
sme: Manadettiin čuovvolii munno olmmái gii lei bargan máŋga jagi Finnmárkkus ja lei dál manname ruoktot .

source: Han var fra Kristiansand og hadde vært hos oss på fjellet , så mine foreldre kjente han .
sme: Son lei kristiansandalaš , lei leamaš min olbmuid luhtte duoddaris ja dovddai mu váhnenguovtto .

source: Jeg tror han snekret hus , men jeg synes også å huske at han var i Samemisjonen .
sme: Doaivvun son snihkkii viesuid , muhto orun muitime su leamaš Sámemiššovnnas maiddái .

source: Jeg husker første gang han kom til lavvuen .
sme: Muittán su vuohččan go bođii min lávvui .

source: Han hadde rare klær , var veldig høy og jeg glante selvfølgelig og lurte på hvem han var .
sme: Sus ledje ártegis gárvvut , lei hui stuoris , mun gávken sutnje ja imaštallen gii son die ges lea .

source: Jeg ante ikke hva han het , men har fått vite senere at det var Adolf , som var søskenbarn til fru Brekke som var lærer på døveskolen .
sme: In diehtán gii son lei , muhto maŋŋil lean gullan ahte son lei Adolf ja lei bealjehemiid skuvlla oahpaheaddji fru Brekke vilbealli .

source: Båten gikk til Tromsø og jeg visste ikke at det var Adolf som skulle følge meg resten av turen til døveskolen .
sme: Fanas manai Romssa gávpogii in ge mun diehtán ahte Adolf dat galggai mu ofelažžan bealjehemiid skuvlii .

source: Sykepleieren gikk av i Tromsø og jeg var nødt å reise videre med mannen alene .
sme: Buohccedikšu bázii Romssa gávpogii , ja mun šadden viidáseappot dan ádjá mielde .

source: Jeg husker at jeg var veldig sur og tverr .
sme: Muittán ledjen hui bahámielas ja jeagoheapmi .

source: Jeg ville ikke skilles fra sykepleieren .
sme: In áigon earránaddat buohccedikšuin .

source: Jeg visste ikke hvor jeg skulle og hun var den som jeg var trygg på .
sme: In diehtán gosa galgen ja su mielde goit ledjen oadjebas .

source: Jeg kjente henne fra gamlehjemmet .
sme: Dovden su boarrásiidruovttu rájes .

source: Små glimt som jeg husker av turen videre var at jeg ble oppmerksom på en båt med et merkelig rør .
sme: Muhtun oasážiid mátkkis lulás maid muittán lea go fuomášin fatnasa mas lei hui ártegis suovvabohcci .

source: Adolf viste med tegn at det eksploderte og at en båt sank .
sme: Adolf čájehii gieđaiguin ahte dat bávkkehii ja muhtun fanas vuojui .

source: Jeg forsto at det var noe som ødela slik som min brors gevær .
sme: Ipmirdin ahte juoga billistii nu go vielljan bissu .

source: Det var en kanon jeg hadde sett .
sme: Kanovnna mun ledjen oaidnán .

source: Jeg husker også at jeg gråt mye på turen sørover .
sme: Muittán go čirron ollu lulás manadettiin .

source: Båten var full av tyskere og de prøvde å leke med meg .
sme: Fatnasis ledje dievva duiskalaččat , ja sii vigge stoagáidahttit mu .

source: Jeg husker de tok bilder og jeg fikk penger og sjokolade .
sme: Muittán go sii govvejedje mu ja ožžon ruđa ja šuhkoláde .

source: De trøstet meg så godt de kunne og var snille . Men da vi kom frem til Trondheim endret ansiktene deres seg .
sme: Sii jeđđejedje mu nu bures go sáhtte ja ledje siivvut , muhto go olliimet Troandimii , de gal sin ámadajut rivde .

source: De ble strenge og avvisende .
sme: Sii šadde bahát ja garrasat .

source: Da jeg forsto at jeg skulle av båten , gråt jeg igjen .
sme: Go ipmirdin ahte dál galgen gáddái , de čirron .

source: Adolf prøvde nok å forklare at det var hit jeg skulle for å gå på skole , men jeg orket ikke forstå .
sme: Adolf geahččalii čilget munnje ahte deike mun galgen skuvlii , muhto mun in gillen šat ipmirdit .

source: Etter hvert resignerte jeg og fulgte med ham .
sme: Maŋážassii vuollánin ja vulgen su mielde .

source: Mitt første inntrykk var krigen , tyskerne og alt som var bombet og ødelagt .
sme: Mu vuosttaš muitogovva doppe lea soahti , duiskalaččat ja go buot lei bombejuvvon ja billahuvvan .

source: Jeg så soldater marsjere i gatene .
sme: Oidnen soalddáhiid vázzime gáhtaid mielde .

source: Det var krigsskip , mye støy og jeg opplevde det som ubehagelig .
sme: Doppe ledje soahtefatnasat , ollu rigearra ja mu mielas lei dat hui unohas .

source: Jeg hadde ikke begrep om krig og heldigvis for det .
sme: Ii mus lean obage ipmárdus soađis , buorelihkus .

source: Jeg var vel litt dum .
sme: Ledjen várra veahá gáiggas nai .

source: Jeg forsto ikke at tyskerne drepte .
sme: In ipmirdan ahte duiskalaččat goddaledje olbmuid .

source: Døveskolen i Trondheim holdt til i dette bygget 1855-1991 .
sme: Troandima bealjehemiid skuvla lei dán visttis 1855-1991 .

source: Nå er bl.a. Norsk Døvemuseum her .
sme: Dál lea ee. Norgga bealjehemiidmusea dás .

source: ( Foto : Norsk Døvemuseum )
sme: ( Govva : Norsk Døvemuseum )

source: Sovesalen på døveskolen , bildet er tatt ca. 1938
sme: Bealjehemiid skuvlla oađđinsála , govviduvvon su. 1938 .

source: ( Foto : Trøndelag Folkemuseum / Schrøderarkivet )
sme: ( Govva : Trøndelag Folkemuseum / Schrøderarkivet )

source: Først da skjønte jeg at jeg var døv
sme: Easka de ipmirdin ahte ledjen bealjeheapmi

source: Vi tok trikken til døveskolen .
sme: Manaime trihka mielde bealjehemiid skuvlii .

source: Det jeg husker av mitt møte med døveskolen var at vi ble mottatt av en lærer som het fru Hansen .
sme: Dat maid muittán das , lea go oahpaheaddji bođii ovddal , su namma lei fru Hansen .

source: Hun smilte , klappet hendene sammen og ga meg en skikkelig klem .
sme: Son moddjái , spežžii gieđaidis oktii ja dollii mu birra .

source: Det syntes jeg var rart .
sme: Mu mielas lei hui ártet .

source: Jeg kjente jo henne ikke .
sme: In dal mun goit dovdan su .

source: Hun tok meg i hånden og leide meg inn i et rom .
sme: Son dollii mu gihtii ja láidii mu muhtun latnjii .

source: Der var det flere elever og de niglodde på meg .
sme: Doppe ledje máŋga oahppi , ja sii gávke munnje .

source: Men mest av alt så brukte de tegn over alt .
sme: Buoremusat muittán go buohkat doppe hupme giehtagiela .

source: Først da skjønte jeg at jeg var døv og at det var flere som var det .
sme: De easka ipmirdin ahte ledjen bealjeheapmi , ja earát ledje maiddái dakkárat .

source: Det gikk også opp for meg at det var det min familie hadde prøvd å fortelle meg når de puttet pekefingrene i ørene og ristet på hodet .
sme: Áddejin ahte min joavkku olbmot dat ledje geahččalan munnje muitalit dan – go ledje coggalan čuvddiideaset bealjeráigái ja bárdán oaivvi .

source: Jeg hadde jo egentlig aldri skjønt hva det betydde .
sme: In lean rievtti mielde goassege ipmirdan mii dat lei .

source: Her sa elevene ; – er du døv ?
sme: Dáppe dadje oahppit : – Leat go bealjeheapmi ?

source: – bruker du tegn ?
sme: – Humat go giehtagiela ?

source: Så kom inspektør fru Sæter .
sme: De bođii bearráigeahčči fru Sæter .

source: Hun sa til meg med tegn : Du – komme – spise .
sme: Son dajai munnje giehtagillii : – Don – boađe – borrat .

source: Vi gikk inn til spisesalen .
sme: Moai manaime boradanlatnjii .

source: Der var det en frodig husmor som het fru Iversen og hun var streng .
sme: Doppe lei váfis áhkku , su namma lei fru Iversen ja son lei hui garas .

source: Jeg ble litt skeptisk til henne .
sme: In luohttán sutnje áibbas .

source: Hun var fra Finnmark , fikk jeg vite senere .
sme: Son lei finnmárkolaš , gullen maŋŋil .

source: Da vi hadde spist gikk vi opp noen etasjer og inn i et klasserom .
sme: Go leimmet boradan , de vácciimet bajás moadde láhttegearddi ja skuvlalatnjii .

source: I den timen var det lærer fru Brekke som var tilstede og jeg skulle lære å skrive navnet mitt .
sme: Oahpaheaddjin dan diimmus lei fru Brekke , ja mun galgen oahppat čállit naman .

source: Da ble jeg forvirret .
sme: De gal seahkánin .

source: Jeg sa jeg het Risten , men skrev Kristen for jeg hadde sett at navnet mitt begynte med « K » her på skolen .
sme: Dadjen mu namma lei Risten , muhto čállen Kristen , go nu ledjen oaidnán iežan nama čállon « K » dán skuvllas .

source: – Nei , sa læreren , – du heter Kirsten !
sme: – Ii , du namma lea Kirsten , dajai oahpaheaddji .

source: Læreren forklarte meg at Kristen var et guttenavn og Kirsten var et jentenavn .
sme: Oahpaheaddji čilgii munnje ahte Kristen lea bártni namma , ja Kirsten lea nieidda namma .

source: Senere så har jeg forstått at hun hadde ikke skjønt at jeg prøvde å si Risten slik jeg hadde lært hjemme på fjellet .
sme: Maŋŋil lean ipmirdan ahte son ii lean ipmirdan ahte mun geahččalin dadjat Risten , nu go ledjen oahppan ruovttus .

source: Hva visste vel hun om samisk ?
sme: Maid ba hal son diđii ge sámi birra ?

source: Jeg godtok hva læreren sa og skrev Kirsten for ettertiden .
sme: Dohkkehin dan maid oahpaheaddji dajai ja čálligohten Kirsten .

source: Og det var jo det som sto i papirene mine .
sme: Ja nu hal lei ge čállon mu báhpiriidda .

source: Men forvirringen ble aldri oppklart mens jeg gikk på skolen .
sme: Dat eahpečielggasvuohta ii čielgan goassege dan áiggis go vázzen skuvlla doppe .

source: Først senere som voksen har jeg skjønt hvorfor det ble slik .
sme: Easka maŋŋil , ollesolmmožin lean ipmirdan manne nu šattai .

source: Da Adolf reiste ble jeg veldig usikker , men det var barn å leke med og jeg lærte fort tegnspråk , – så det gikk bra .
sme: Go Adolf vulggii fas , de šadden hui eahpádussii , muhto doppe ledje mánát geaiguin stohken , ja ohppen jođánit giehtagiela – manai bures .

source: Og jeg fikk artikulasjonstrening og lærte å prate på norsk , vel det var ord og navn på forskjellige ting .
sme: Ja ohppen maiddái cealkit sániid ja ohppen hupmat dárogiela , iešguđetlágan dávviriin ledje gusto sánit ja namat .

source: Kautokeino skolestyres arkiv 1943
sme: Guovdageainnu skuvlastivrra vuorká 1943

source: Ref. av Risten Saras karakterer ved Døveskolen pr. 18/12-43
sme: Risten Sara árvosánit Bealjehemiid skuvllas pr. 18/12-43

source: Åtte år på internatet
sme: Gávcci jagi internáhtas

source: Jeg bodde på internat på døveskolen i Trondheim i åtte år .
sme: Orron bealjehemiid skuvlla internáhtas Troandimis gávcci jagi .

source: Der fikk jeg venner og hadde det bra .
sme: Doppe ožžon ustibiid ja mus lei buorre dilli .

source: Jeg trivdes godt .
sme: Lokten áiggi bures .

source: Det var ingen som mobbet meg for at jeg var samisk eller noe slikt .
sme: Ii oktage hárdán mu danne go ledjen sápmelaš dehe eará dihte .

source: Det var et godt miljø blant elevene .
sme: Ohppiid gaskkas lei buorre biras .

source: Men helt fri for mobbing var det ikke .
sme: Áibbas hárdima haga goitge ii lean .

source: Det var en jente fra Harstad som noen elever mente så samisk ut og de terget henne for det .
sme: Eará oahppit hárde muhtun Harstada nieiddaža go sus lei sámi hápmi .

source: Da gråt hun og pleide å si at jeg var heldig som ikke hadde samiske trekk så jeg slapp å bli mobbet .
sme: Nieiddaš čierui ja dajai mus lei lihkku go ii lean sámi hápmi eai ge hárdán mu .

source: Hva nå det skulle bety ?
sme: Maid son dainna oaivvildii ?

source: Hun var vel kanskje samisk .
sme: Soittii ieš sápmelaš .

source: Elever på døveskolen spiller " Rødhette og ulven " .
sme: Bealjehemiid skuvlla oahppit nektet « Ruksesgahpir ja gumpe » .

source: Kirsten Sara er nr. 3 fra venstre foran .
sme: Kirsten Sara lea nr. 3 gurut bealde .

source: Helt til høyre i bildet er Sigurd Ottar Ørsnes , som hun seinere gifta seg med .
sme: Olgeš bealde lea Sigurd Ottar Ørsnes , geainna maŋŋil náitalii .

source: Lite kontakt med familien
sme: Unnán oktavuohta ruovttuin

source: Ingen i familien kom til Trondheim og så hvordan jeg hadde det på døveskolen .
sme: Ii oktage min joavkkus boahtán Troandimii geahččat mot muinna lea bealjehemiid skuvllas .

source: Min mor var aldri der , heller ikke til min konfirmasjon .
sme: Eadnán ii fitnan goassege doppe , ii mu konfirmašuvnnain ge .

source: Flere andre elever fikk gaver , men det kom ingenting hjemmefra til meg .
sme: Ollu eará oahppit ožžo skeaŋkkaid , muhto munnje ii boahtán ruovttus ii mihkkege .

source: Det var aldri snakk om det på skolen .
sme: Eai skuvllas hupman goassege dan birra .

source: Heller ikke til jul var det gave .
sme: In vel juovllaide ge ožžon skeaŋkka .

source: Men jeg fikk et smykke fra en lærer engang .
sme: Muhtumin ožžon čikŋahearvva oahpaheaddjis .

source: Det var en elev til som heller ikke fikk gaver hjemmefra og som fikk noe fra den samme læreren .
sme: Muhtun eará oahppi ii ge ožžon maidege ruovttus , ja son maiddái oaččui juoidá dan oahpaheaddjis .

source: Hun syntes vel synd på oss , men det var ikke tradisjon for oss å gi gaver på den måten .
sme: Oahpaheaddji mielas leimme moai várra nu heajut , muhto ii hal mis lean dakkár vierru attašit skeaŋkkaid dainna lágiin .

source: Jeg kom til internatet da jeg var ni – ti år og bodde der til jeg var 17 år .
sme: Bohten internáhttii go ledjen ovcci – logi jahkásaš ja orron doppe dassážii go ledjen 17-jahkásaš .

source: På den tiden hadde jeg kontakt med familien min i sommerferien .
sme: Dan gaskkas oidnen iežamet joavkku olbmuid geasseluomus .

source: Resten av året var kontakten via brev .
sme: Muđui reivvestalaimet .

source: Oddmund Sandvik , som bodde i Siebe , kunne norsk , så han hjalp mor å skrive .
sme: Oddmund Sandvik , gii orui Siebes , máhtii dárogiela , veahkehii eatnán čállit .

source: Min bror var flink til å skrive og han sendte brev til meg av og til .
sme: Eadnán lei čeahppi čállit , ja Oddmund sáddii munnje reivve duollet dálle .

source: Dessuten fikk jeg også brev fra andre slektninger .
sme: Eará fulkkiin maiddái ožžon reivviid .

source: Det var moro å brevveksle og på den måten holdt vi kontakt gjennom årene .
sme: Lei suohtas reivvestallat , ja nu mii gulahalaimet čuovvovaš jagiid .

source: Jeg har fremdeles gjemt på det første julekortet jeg fikk .
sme: Mus lea ain áimmuin vuosttaš juovlakoarta man ožžon .

source: Der sto det « God Jul » med en pen håndskrift .
sme: Dasa lei čállon « God Jul » čáppa giehtačállagiin .

source: Jeg fikk det i 1940 og jeg har gjemt det som en skatt .
sme: Ožžon dan 1940:s , ja lean álo vurkkodan dan dego hui divrras dávvira .

source: Når det ble sommerferie , reiste jeg til Kvænangen .
sme: Go šattai geasseluopmu , de lávejin vuolgit Návutnii .

source: Der bodde jeg hos pleieforeldre til mine foreldre kunne komme og hente meg .
sme: Doppe orron biebmováhnemiid luhtte dassážii go mu váhnemat bođiige viežžat mu .

source: Men til jul eller påske var det ingen hjemreise .
sme: Juovllaide ja beassážiidda gal in beassan vuolgit ruoktot .

source: Det var ikke penger til den slags .
sme: Eai dasa lean ruđat .

source: Man ble på døveskolen .
sme: Fertiimet bissut bealjehemiid skuvllas .

source: Mor sendte penger til meg den tiden jeg gikk på skolen , så jeg manglet ingenting .
sme: Eadni lávii sáddet munnje ruđa dalle go vázzen bealjehemiid skuvlla , ii mus váilon mihkkege .

source: Det var slik at når vi reiste hjem på ferie dro alle som skulle med båt nordover sammen i følge med en fra døveskolen .
sme: Lávii nu ahte go vulggiimet ruoktot lupmui , de vulggiimet fárrolaga buohkat geat galggaimet davás fatnasa mielde , ja bealjehemiid skuvlla bargi lei ofelažžan .

source: Etter hvert som båten la til kaiene sto det alltid noen som fulgte elevene videre , enten familie eller noen andre .
sme: Dađistaga go fanas ain gáddánii kájáid lusa , de bohte muhtumat ohppiid ovddal , juogo fuolkkit dehe earát .

source: Så når båten la til kai der jeg skulle av , kom pleieforeldrene mine og hentet meg .
sme: Go fanas ollii gáddái dohko gosa mun galgen , de bođiiga biebmováhnemat viežžat mu .

source: Vi rodde natta hjem .
sme: Sugaimet ruoktot ihkku .

source: Det var jo lite med transportmidler den gang og i alle fall under krigen .
sme: Eai dalle lean dat oallut fievrrut ja sáhtut , eai soahteáigge goit .

source: Samme når vi skulle tilbake .
sme: Nu lei maiddái go vulggiimet fas skuvlii .

source: Jeg ble rodd det første stykket , så en overnatting og lokalbåt til Tromsø .
sme: Soai suvddiiga mu vuosttaš oasi mátkkis , de idjadit ja de báikkálaš fatnasa mielde Romssa gávpogii .

source: Deretter på den store hurtigruta hvor det var en fra døveskolen som reiste sammen med alle elevene .
sme: Doppe dan stuora johtilisfatnasa mielde lei bealjehemiid bargi min ofelažžan .

source: Det kom på elever både i Harstad og Bodø samt andre steder nedover kysten .
sme: Sihke Harstadas ja Bodeajjus bohte oahppit fatnasii , ja eará mearragátte báikkiin guvlui .

source: Mine pleieforeldre i Kvænangen var snille , men strenge .
sme: Mu biebmováhnen guovttos Návuonas leigga siivvut , muhto garrasat muinna .

source: Jeg hadde veldig respekt for dem.
sme: Mun duođalaččat áktejin sudno .

source: Senere når jeg skulle tilbake til døveskolen , ble jeg fulgt av Reidar Johansen . som var eldste sønn i huset .
sme: Maŋŋil , go vulgen fas bealjehemiid skuvlii , de čuovui sudno boarráseamos bárdni Reidar mu .

source: Han var 23–24 år den gangen .
sme: Son lei 23–24-jahkásaš dalle .

source: Han tok godt vare på meg og ordnet opp når jeg skulle reise .
sme: Son rábidii buot mu ovddas ja ráhkkanii munnje veahkkin .

source: Vi kommuniserte ved å prate og skrive lapper .
sme: Moai gulahalaime čálašemiin báberbihtáide .

source: Jeg har mye å takke ham for .
sme: Lean hui giitevaš sutnje .

source: Pleiefamilien var nok en « verdefamilie » [ 4 ] for oss .
sme: Biebmojoavku ledje fal min verddet .

source: Vist fram i samekofte
sme: Čájehuvvojin gávttiin

source: – Det er mye jeg kan trekke fram fra skoletiden , men jeg husker spesielt en artikulasjons- og munnavlesningstime i første klasse .
sme: – Livččii ollu muitaleamoš skuvlaáiggis , muhto muittán erenoamážit čielgasit cealkin- ja bavssaipmirdandiimmu vuosttaš klássas .
